# 2주차

## Swift에서 지역 범위와 전역 범위의 차이점을 설명하십시오.

- 지역범위
    - 함수 내에서 변수를 선언하면 해당 함수에서만 선언한 변수를 사용할수 있다.
    - 즉, 선언한 함수내 또는 하위 함수에만 접근이 가능하다.
- 전역 범위
    - 어디서든 접근이 가능하다. 최상위 에서 변수를 선언하면 가능하다.
    - 즉, 파일내 어디서든 접근이 가능하다.

## 튜플을 입력으로 받아 두 요소의 합을 반환하는 함수를 만듭니다.

- 함수에 특정 그룹화 된 값을 받아 반환하는 함수

```jsx
func sum(_ myValue: (Int, Int)) -> Int {
	return myValue.0 + myValue.1
}

const value = (5, 3)
let mySum = sum(value)
```

## 옵셔널 정수(Int?)를 받아 2를 곱한 수(두배)를 반환하거나 입력이 nil인 경우 기본값을 반환하는 함수를 작성합니다.

- 옵셔널 정수를 받아 옵셔널이면 0을 반환
- if let을 이용하여 옵셔널을 벗긴후 옵셔널 값이 아니면 2을 곱한 값 반환

```jsx
func multiple(num: Int?) -> Int {
    if let n = num {
        return n * 2
    }
    return 0
}

multiple(num: 10)
multiple(num: nil)
```

## 연관 값이 있는 열거형을 만들고 switch 문에서 사용하는 예제를 작성하세요.

- 열거형
    - 타입 자체를 한정된 사례 안에서 정의할 수 있는 타입
- 원시값
    - 타입을 생성하거나 다룰때 조금 더 편하게 사용하는 목적
- 연관값
    - 보다 구체적이고 정보를 저장할때 사용
